<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <!-- DNS Configuration Payload -->
        <dict>
            <key>PayloadDisplayName</key>
            <string>Ninja DNS Server</string>
            <key>PayloadDescription</key>
            <string>Настройка Ninja DNS сервера для обхода геоблокировки</string>
            <key>PayloadIdentifier</key>
            <string>ru.uzicus.dns.config</string>
            <key>PayloadType</key>
            <string>com.apple.dnsSettings.managed</string>
            <key>PayloadUUID</key>
            <string>A1B2C3D4-E5F6-7G8H-9I0J-K1L2M3N4O5P6</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>DNSSettings</key>
            <dict>
                <key>DNSProtocol</key>
                <string>HTTPS</string>
                <key>ServerAddresses</key>
                <array>
                    <string>185.237.95.211</string>
                </array>
                <key>ServerURL</key>
                <string>https://dns.uzicus.ru/dns-query</string>
                <key>SupplementalMatchDomains</key>
                <array>
                    <string></string>
                </array>
            </dict>
        </dict>
        
        <!-- DNS-over-TLS Configuration -->
        <dict>
            <key>PayloadDisplayName</key>
            <string>Ninja DNS over TLS</string>
            <key>PayloadDescription</key>
            <string>Настройка DNS-over-TLS для защищенных DNS запросов</string>
            <key>PayloadIdentifier</key>
            <string>ru.uzicus.dns.dot</string>
            <key>PayloadType</key>
            <string>com.apple.dnsSettings.managed</string>
            <key>PayloadUUID</key>
            <string>B2C3D4E5-F6G7-8H9I-0J1K-L2M3N4O5P6Q7</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>DNSSettings</key>
            <dict>
                <key>DNSProtocol</key>
                <string>TLS</string>
                <key>ServerAddresses</key>
                <array>
                    <string>185.237.95.211</string>
                </array>
                <key>ServerName</key>
                <string>dns.uzicus.ru</string>
                <key>SupplementalMatchDomains</key>
                <array>
                    <string></string>
                </array>
            </dict>
        </dict>
        
        <!-- Traditional DNS Fallback -->
        <dict>
            <key>PayloadDisplayName</key>
            <string>Ninja DNS Traditional</string>
            <key>PayloadDescription</key>
            <string>Традиционная DNS конфигурация как резервная</string>
            <key>PayloadIdentifier</key>
            <string>ru.uzicus.dns.traditional</string>
            <key>PayloadType</key>
            <string>com.apple.dnsSettings.managed</string>
            <key>PayloadUUID</key>
            <string>C3D4E5F6-G7H8-9I0J-1K2L-M3N4O5P6Q7R8</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>DNSSettings</key>
            <dict>
                <key>DNSProtocol</key>
                <string>UDP</string>
                <key>ServerAddresses</key>
                <array>
                    <string>185.237.95.211</string>
                    <string>1.1.1.1</string>
                    <string>8.8.8.8</string>
                </array>
                <key>SupplementalMatchDomains</key>
                <array>
                    <string></string>
                </array>
            </dict>
        </dict>
    </array>
    
    <!-- Main Profile Information -->
    <key>PayloadDisplayName</key>
    <string>Ninja DNS - Secure DNS Configuration</string>
    <key>PayloadDescription</key>
    <string>Профиль для настройки Ninja DNS сервера с поддержкой DoH, DoT и традиционного DNS. Обеспечивает обход геоблокировки и защищенную передачу DNS запросов.</string>
    <key>PayloadIdentifier</key>
    <string>ru.uzicus.baltic-dns</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>D4E5F6G7-H8I9-0J1K-2L3M-N4O5P6Q7R8S9</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    
    <!-- Organization Information -->
    <key>PayloadOrganization</key>
    <string>Ninja DNS</string>
    
    <!-- Scope - User level installation -->
    <key>PayloadScope</key>
    <string>User</string>
    
    <!-- Compatible platforms -->
    <key>TargetDeviceType</key>
    <integer>0</integer>
    
    <!-- Auto removal after specified period (optional) -->
    <key>RemovalDate</key>
    <date>2025-12-31T23:59:59Z</date>
    
    <!-- Additional metadata -->
    <key>ConsentText</key>
    <dict>
        <key>default</key>
        <string>Этот профиль настроит ваше устройство на использование Ninja DNS сервера для улучшенной приватности и обхода геоблокировки. 

DNS запросы будут направляться через:
• DNS-over-HTTPS (DoH): https://dns.uzicus.ru/dns-query  
• DNS-over-TLS (DoT): dns.uzicus.ru:853
• Традиционный DNS: 185.237.95.211

Профиль может быть удален в любое время через Настройки > Основные > Профили.

Продолжить установку?</string>
        <key>ru</key>
        <string>Этот профиль настроит ваше устройство на использование Ninja DNS сервера для улучшенной приватности и обхода геоблокировки. 

DNS запросы будут направляться через:
• DNS-over-HTTPS (DoH): https://dns.uzicus.ru/dns-query  
• DNS-over-TLS (DoT): dns.uzicus.ru:853
• Традиционный DNS: 185.237.95.211

Профиль может быть удален в любое время через Настройки > Основные > Профили.

Продолжить установку?</string>
    </dict>
</dict>
</plist>